---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintY
source: html/aa0fac4f-b738-727c-0677-884c6fa044fa.htm
---
# Autodesk.Revit.DB.ParameterTypeId.BoundaryRestraintY Property

"Y Spring Modulus"

## Syntax (C#)
```csharp
public static ForgeTypeId BoundaryRestraintY { get; }
```